Jerry-ESP/esp-matter/awox_light/light_cw_pwm/sdkconfig.defaults.esp32h2
CONFIG_IDF_TARGET="esp32h2"

# libsodium
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=y

# NIMBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_BT_NIMBLE_HCI_EVT_BUF_SIZE=70
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=n

# FreeRTOS should use legacy API
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y

# Enable OpenThread
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n


# Disable lwip ipv6 autoconfig
CONFIG_LWIP_IPV6_AUTOCONFIG=n

# Use a custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../common/TargetConfig/partitions_4MB.csv"

# LwIP config for OpenThread
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y

# MDNS platform
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# Enable OTA Requestor
CONFIG_ENABLE_OTA_REQUESTOR=y

# Disable STA and AP for ESP32H2
CONFIG_ENABLE_WIFI_STATION=n
CONFIG_ENABLE_WIFI_AP=n

# Enable chip shell
CONFIG_ENABLE_CHIP_SHELL=n

# Disable persist subscriptions
CONFIG_ENABLE_PERSIST_SUBSCRIPTIONS=n

# MRP configs
CONFIG_MRP_LOCAL_ACTIVE_RETRY_INTERVAL_FOR_THREAD=5000
CONFIG_MRP_LOCAL_IDLE_RETRY_INTERVAL_FOR_THREAD=5000
CONFIG_MRP_RETRY_INTERVAL_SENDER_BOOST_FOR_THREAD=5000
CONFIG_MRP_MAX_RETRANS=3

# Enable External Platform
CONFIG_CHIP_ENABLE_EXTERNAL_PLATFORM=y
CONFIG_CHIP_EXTERNAL_PLATFORM_DIR="../../../../awox_light/common/platform/ESP32_custom"
CONFIG_CHIP_EXTERNAL_PLATFORM_INCLUDE_DIR="../../../../awox_light/common/"

CONFIG_BT_NIMBLE_EXT_ADV=y

CONFIG_PRODUCT_ID=0x6097
CONFIG_MODEL_NAME="EGLO-ZMB-TW"
CONFIG_DEVICE_TYPE=light
CONFIG_HARDWARE_VERSION_MAJOR=6
CONFIG_HARDWARE_VERSION_MINOR=00
CONFIG_FIRMWARE_VERSION="1.0.0"
CONFIG_FIRMWARE_VERSION_MAJOR=1
CONFIG_FIRMWARE_VERSION_MINOR=0
CONFIG_FIRMWARE_VERSION_PATCH=0

CONFIG_MODULE_VERSION_DEVKIT=y

#
# Drivers
#
CONFIG_ENABLE_PWM_DRIVER=y
# CONFIG_PWM_ENABLE_HW_FADE is not set
CONFIG_ENABLE_SM2135EH_DRIVER=n
CONFIG_ENABLE_SM2x35EGH_DRIVER=n
CONFIG_ENABLE_BP57x8D_DRIVER=n
CONFIG_ENABLE_BP1658CJ_DRIVER=n
CONFIG_ENABLE_KP18058_DRIVER=n
CONFIG_ENABLE_WS2812_DRIVER=n

#
#Factory Data Provider
#
CONFIG_ENABLE_ESP32_FACTORY_DATA_PROVIDER=y
CONFIG_ENABLE_ESP32_DEVICE_INSTANCE_INFO_PROVIDER=y
CONFIG_ENABLE_ESP32_DEVICE_INFO_PROVIDER=y
CONFIG_ESP_MATTER_COMMISSIONABLE_DATA_PROVIDER=y
CONFIG_ESP_MATTER_DEVICE_INSTANCE_INFO_PROVIDER=y
CONFIG_CHIP_FACTORY_NAMESPACE_PARTITION_LABEL="fctry"

#
#Use secure cert DAC provider
#
CONFIG_SEC_CERT_DAC_PROVIDER=y

#
#Use custom certifica declaration
#
CONFIG_ENABLE_SET_CERT_DECLARATION_API=y

#
#Disable DS_PERIPHERAL only for test
#
CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL=n
CONFIG_USE_ESP32_ECDSA_PERIPHERAL=n

# Enable DS Peripheral
#CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL=y

#
# Bootloader config (Custom)
#
CONFIG_BOOTLOADER_COMPRESSED_ENABLED=y
CONFIG_BOOTLOADER_DECOMPRESSOR_XZ=y
CONFIG_BOOTLOADER_LOG_LEVEL=0
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_ON_POWER_ON=n # If set to "y" will go faster but can be risky

#
# Security options
#
#CONFIG_SECURE_FLASH_ENC_ENABLED=y
#CONFIG_NVS_ENCRYPTION=y
#CONFIG_SECURE_FLASH_SKIP_WRITE_PROTECTION_CACHE=y
#CONFIG_SECURE_FLASH_ENCRYPTION_MODE_DEVELOPMENT=y
#CONFIG_SECURE_INSECURE_ALLOW_DL_MODE=y
#CONFIG_SECURE_FLASH_UART_BOOTLOADER_ALLOW_ENC=y
#CONFIG_SECURE_SIGNED_ON_BOOT=y
#CONFIG_SECURE_SIGNED_ON_UPDATE=y
#CONFIG_SECURE_SIGNED_APPS=y
#CONFIG_SECURE_BOOT_V2_RSA_SUPPORTED=y
#CONFIG_SECURE_BOOT_V2_PREFERRED=y
#CONFIG_SECURE_BOOT=y
#CONFIG_SECURE_BOOT_V2_ENABLED=y
#CONFIG_SECURE_SIGNED_APPS_RSA_SCHEME=y
#CONFIG_SECURE_BOOT_BUILD_SIGNED_BINARIES=y
#CONFIG_SECURE_BOOT_SIGNING_KEY="../TargetConfig/secure_boot_signing_key.pem"
